# GetValidSymbols Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FormatOptions..::..GetValidSymbols Method
FormatOptions Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetValidSymbols()()()() | Gets the identifiers of all valid symbols for the unit in this FormatOptions. |
| GetValidSymbols(ForgeTypeId) | Gets the identifiers of all valid symbols for a given unit. |

# See Also
FormatOptions Class
FormatOptions Members
Autodesk.Revit.DB Namespace